apps/api/tests/performance/load-test.yml
config:
  target: "http://localhost:5000" 
  
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Phase 1: Morning trickle (5 users/sec)"
    - duration: 60
      arrivalRate: 40
      name: "Phase 2: School starts (40 users/sec)"
    - duration: 30
      arrivalRate: 10
      rampTo: 80
      name: "Phase 3: Everyone logging in at once (Spike to 80 users/sec)"

scenarios:

  - name: "Student Daily Workflow"
    weight: 5 
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            identifier: "student@test.com"
            password: "Password123!"
          capture:
            - json: "$.accessToken"
              as: "token"
      - think: 1 # Pause to simulate UI rendering
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/v1/modules"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2 # Reading the modules
      - get:
          url: "/api/v1/assignments"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/v1/quizzes/results/my" # Checking their past quiz scores
          headers:
            Authorization: "Bearer {{ token }}"


  - name: "Donor Browsing Donations"
    weight: 3
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            identifier: "donor@test.com"
            password: "Password123!"
          capture:
            - json: "$.accessToken"
              as: "token"
      - get:
          url: "/api/v1/donor/overview"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2 
      - get:
          url: "/api/v1/donor" # Gets all needs
          headers:
            Authorization: "Bearer {{ token }}"


  - name: "School Admin Morning Check"
    weight: 1
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            identifier: "schooladmin@test.com"
            password: "Password123!"
          capture:
            - json: "$.accessToken"
              as: "token"
      - get:
          url: "/api/v1/school-admin/my-school"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/v1/school-admin/teachers/pending"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/v1/school-admin/students"
          headers:
            Authorization: "Bearer {{ token }}"


  - name: "Public Web Traffic"
    weight: 1
    flow:
      - get:
          url: "/api/v1/users/schools" # Fetching the public school list
      - think: 1
      - get:
          url: "/api/v1/knowledge-base/public" # Reading public articles